{
  "nodes": [
    {
      "op": "null", 
      "name": "3", 
      "attrs": {"__shape__": "(100,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "1", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 0, 0)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "2", 
      "attrs": {"__shape__": "(100, 1, 3, 300)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 300)", 
        "no_bias": "True", 
        "num_filter": "100", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[1, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "3", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attrs": {"axis": "2"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split3", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(51,)", 
        "pool_type": "max", 
        "stride": "(51,)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split4", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5", 
      "attrs": {"__shape__": "(100,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 3, 3, 0, 0)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4", 
      "attrs": {"__shape__": "(100, 1, 4, 300)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(4, 300)", 
        "no_bias": "True", 
        "num_filter": "100", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add1", 
      "inputs": [[15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split1", 
      "attrs": {
        "axis": "3", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims1", 
      "attrs": {"axis": "2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split5", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attrs": {
        "kernel": "(52,)", 
        "pool_type": "max", 
        "stride": "(52,)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split6", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "7", 
      "attrs": {"__shape__": "(100,)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(1, -1, 1, 1)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 4, 4, 0, 0)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "6", 
      "attrs": {"__shape__": "(100, 1, 5, 300)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 300)", 
        "no_bias": "True", 
        "num_filter": "100", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add2", 
      "inputs": [[28, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split2", 
      "attrs": {
        "axis": "3", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims2", 
      "attrs": {"axis": "2"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split7", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(53,)", 
        "pool_type": "max", 
        "stride": "(53,)"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split8", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[13, 0, 0], [26, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {
        "mode": "training", 
        "p": "0.5"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "8", 
      "attrs": {"__shape__": "(6, 300)"}, 
      "inputs": []
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "linalg_gemm20", 
      "attrs": {
        "alpha": "1.0", 
        "transpose_a": "0", 
        "transpose_b": "1"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "9", 
      "attrs": {"__shape__": "(6,)"}, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add3", 
      "inputs": [[44, 0, 0], [46, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 4, 14, 17, 27, 30, 43, 45], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49
  ], 
  "heads": [[47, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}